; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-4)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 12516)
	(= (fuel plane1) 4391)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 16)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 8)
	(at plane2 city2)
	(= (capacity plane2) 10978)
	(= (fuel plane2) 1919)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 14)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at person1 city4)
	(at person2 city0)
	(at person3 city0)
	(at person4 city4)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 955)
	(= (distance city0 city2) 654)
	(= (distance city0 city3) 693)
	(= (distance city0 city4) 714)
	(= (distance city0 city5) 877)
	(= (distance city1 city0) 955)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 904)
	(= (distance city1 city3) 855)
	(= (distance city1 city4) 743)
	(= (distance city1 city5) 604)
	(= (distance city2 city0) 654)
	(= (distance city2 city1) 904)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 686)
	(= (distance city2 city4) 785)
	(= (distance city2 city5) 701)
	(= (distance city3 city0) 693)
	(= (distance city3 city1) 855)
	(= (distance city3 city2) 686)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 956)
	(= (distance city3 city5) 757)
	(= (distance city4 city0) 714)
	(= (distance city4 city1) 743)
	(= (distance city4 city2) 785)
	(= (distance city4 city3) 956)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 736)
	(= (distance city5 city0) 877)
	(= (distance city5 city1) 604)
	(= (distance city5 city2) 701)
	(= (distance city5 city3) 757)
	(= (distance city5 city4) 736)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city3)
	(at person2 city1)
	(at person3 city4)
	(at person4 city2)
	))

(:metric minimize (+ (* 2 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (board person1 plane1 city4)
   deleted: (at person1 city4)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 0 of 4
2. (board person4 plane1 city4)
   deleted: (at person4 city4)
   added: (in person4 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 0 of 4
3. (refuel plane1 city4)
   changed: (fuel plane1) from 4391 to 12516
   goals met: 0 of 4
4. (fly plane1 city4 city3)
   deleted: (at plane1 city4)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 0 to 4780, (fuel plane1) from 12516 to 7736
   goals met: 0 of 4
5. (debark person1 plane1 city3)
   deleted: (in person1 plane1)
   added: (at person1 city3)
   changed: (onboard plane1) from 2 to 1
   goals met: 1 of 4
6. (fly plane1 city3 city4)
   deleted: (at plane1 city3)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 4780 to 9560, (fuel plane1) from 7736 to 2956
   goals met: 1 of 4
7. (refuel plane1 city4)
   changed: (fuel plane1) from 2956 to 12516
   goals met: 1 of 4
8. (fly plane1 city4 city2)
   deleted: (at plane1 city4)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 9560 to 13485, (fuel plane1) from 12516 to 8591
   goals met: 1 of 4
9. (debark person4 plane1 city2)
   deleted: (in person4 plane1)
   added: (at person4 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 2 of 4
10. (fly plane1 city2 city0)
   deleted: (at plane1 city2)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 13485 to 16755, (fuel plane1) from 8591 to 5321
   goals met: 2 of 4
11. (board person2 plane1 city0)
   deleted: (at person2 city0)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 4
12. (board person3 plane1 city0)
   deleted: (at person3 city0)
   added: (in person3 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 2 of 4
13. (fly plane1 city0 city1)
   deleted: (at plane1 city0)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 16755 to 21530, (fuel plane1) from 5321 to 546
   goals met: 2 of 4
14. (debark person2 plane1 city1)
   deleted: (in person2 plane1)
   added: (at person2 city1)
   changed: (onboard plane1) from 2 to 1
   goals met: 3 of 4
15. (refuel plane1 city1)
   changed: (fuel plane1) from 546 to 12516
   goals met: 3 of 4
16. (fly plane1 city1 city4)
   deleted: (at plane1 city1)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 21530 to 25245, (fuel plane1) from 12516 to 8801
   goals met: 3 of 4
17. (debark person3 plane1 city4)
   deleted: (in person3 plane1)
   added: (at person3 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 4
